# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

a = int(input('Ввести первое число: '))
b = int(input('Ввести второе число: '))
c = int(input('Ввести третье число: '))

print(a, ' + ', b, ' + ', c, ' = ', a + b + c)

a = int(input('Ввести первое число: '))
b = int(input('Ввести второе число: '))
c = int(input('Ввести третье число: '))

print(a, ' + ', b, ' + ', c, ' = ', a + b + c)
